backend/performance-tests/baseline-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  processor: "./before-scenario.js"
scenarios:
  - name: "Public API Endpoints"
    flow:
      # Health check
      - get:
          url: "/"
          name: "Health Check"
          expect:
            - statusCode: 200
      
      # Get all products
      - get:
          url: "/api/products"
          name: "Get All Products"
          expect:
            - statusCode: 200
      
      # Get single product
      - get:
          url: "/api/products/507f1f77bcf86cd799439011"
          name: "Get Single Product"
          expect:
            - statusCode: 200